// 3. Создать простейшее приложение, использующее OpenMP.
// Приложение должно выводить в консоль строку вида "Hello World!".
// Каждый поток должен инкрементировать переменную i,
// инициализурованную нулевым значением.
// Также каждый поток должен вывести значение переменной i
/*
   Для изоляции более сложных составных команд с возможным
вызовом пользовательских и системных функций следует использовать
директиву critical, которая допускает (в отличие от директивы atomic)
возможность расширения своей области действия на блок операций,
заключѐнный в фигурные скобки, при этом каждая critical-секция может
иметь имя, позволяющее сгруппировать разные критические секции по
этому имени, чтобы предотвратить появление единой распределѐнной по
всей программе критической секции.

В этом случае функция printf в строке 38 выполняется всеми потоками
параллельно, что может привести к перемешиванию выводимых символов.
Напротив, функция printf в строке 42 выполняется потоками строго по
очереди, что предотвращает возможные конфликты между ними, однако
замедляет выполнение программы из-за искусственного ограничения
коэффициента распараллеленности.
*/

// Компиляция:
// gcc -fopenmp main.c -o app

// Запуск
// ./app

#include <stdio.h>
#include <omp.h>
 
int main ()  
{
   int i = 1;
   #pragma omp parallel
   {
      printf("Hello, world!\n");
      #pragma omp critical
      {
         i++;
         printf("i=%d\n", i);
      }
   }
}