// 2. Создать простейшее приложение, использующее OpenMP.
// Приложение должно выводить в консоль строку вида "Hello World!".
// Каждый поток должен инкрементировать переменную i,
// инициализурованную нулевым значением.
/*
Действие директивы pragma распространяется на следующий за ней
исполняемый блок. В данном случае это вызов функции printf, но можно
было бы заключить произвольное количество операций в фигурные
скобки, чтобы расширить исполняемый блок.

В этой программе заключенный в фигурные скобки блок операций
выполняется одновременно на нескольких ядрах.
При этом в строке 5 процессору даѐтся указание выполнить
операцию "i++" атомарно, т.е. не параллельно,
а последовательно каждым из потоков.

С одной стороны, это приводит к тому, что операция инкремента
перестаѐт быть распараллеленной, что снижает скорость многоядерного
выполнения.
С другой стороны, директива atomic в данном случае
необходима, т.к. иначе могла бы возникнуть сложно обнаружимая
проблема с гонкой данных, проявляющаяся в конфликте при записи
данных в общую область памяти одновременно несколькими потоками в
переменную i.

Заметим, что директива atomic может применяться только
для однострочных простых команд присваивания.
*/

// Компиляция:
// gcc -fopenmp main.c -o app

// Запуск
// ./app

#include <stdio.h>
#include <omp.h>
 
int main ()  
{
   int i = 1;
   #pragma omp parallel
   {
      printf("Hello, world!\n");
      #pragma omp atomic
      i++;
   }
   printf("i = %d\n", i);
}