// 1. Создать простейшее приложение, использующее OpenMP.
// Приложение должно выводить в консоль строку вида "Hello World!"
/*
Результатом работы будет выведенное несколько раз в консоль
сообщение. Количество сообщений определяется количеством логических
процессоров, доступных системе (например, при использовании
технологии HyperThreading при двух ядрах количество логических
процессоров будет равно четырем).
*/

// Компиляция:
// gcc -fopenmp main.c -o app

// Запуск
// ./app

#include <stdio.h>
#include <omp.h>
 
int main ()  
{
   #pragma omp parallel
   printf("Hello, world!\n");
}